Repository: ChrisKamanzi/lost-and-found
Catalog: lib/l10n/app_*.arb
Languages: rw

# loginTitle
source: Log In.
rw: Injira.

# emailLabel
source: Email
rw: Imeli

# passwordLabel
source: Password
rw: Ijambo ry’ibanga

source: Forgot Password
rw: Wibagiwe ijambo ry’ibanga

# loginButton
source: Log In
rw: Injira

# noAccount
source: Don't have an account?
rw: Nta konti ufite?

source: Sign Up
rw: Iyandikishe

# signUpTitle
source: Sign Up.
rw: Iyandikishe.

# nameLabel
source: NAME
rw: Izina

# passwordConfirmationLabel
source: PASSWORD CONFIRMATION
rw: EMEZA IJAMBO RY’IBANGA

# phoneLabel
source: PHONE
rw: TELEFONI

# villageLabel
source: VILLAGE
rw: UMUDUGUDU

# selectVillage
source: Select a Village
rw: Hitamo Umudugudu

# signUpButton
source: Sign Up
rw: Iyandikishe

# alreadyHaveAccount
source: Already have an account?
rw: Ufite konti?

# resetPassword
source: réinitialiser le mot de passe
rw: Hindura ijambo ry’ibanga

# reportFoundTitle
source: Report Found
rw: IBBIKORESHO BYABONETSE

# reportFoundDescription
source: An item lost and found can easily be reported or an ad could be created
rw: Ikintu cyatakaye cyangwa cyabonetse gishobora gutangazwa cyangwa hakarebwa itangazo rishyirwaho

# searchMapTitle
source: Search Map
rw: Shakisha kuri Karita

# searchMapDescription
source: Search for found items or found close to your location be showed on the map
rw: Shakisha ibintu byatakaye cyangwa byabonetse hafi yawe bikagaragara kuri karita

# messagingTitle
source: Messaging
rw: Ubutumwa

# messagingDescription
source: last app allows interaction between users
rw: Ubu buryo bwa porogaramu butuma abakoresha bashobora kuganira

# aboutUsAppBarTitle
source: About Us
rw: Ibyerekeye Twebwe

# aboutUsHeading
source: ABOUT US
rw: IBYEREKEYE TWEBWE

# aboutUsDescription
source: We believe in the power of community and compassion. Our platform connects people who have lost valuable items with those who’ve found them — making it easier than ever to reunite lost belongings with their rightful owners.
rw: Twemera imbaraga z'ubufatanye. Urubuga rwacu ruhuza abantu bataye ibintu by'agaciro n'ababibonye — bigatuma byoroha kongera guhuza ibitaye n'ababifite.

# aboutUsFeaturesTitle
source: FEATURES
rw: IBIRANGA

source: Hello
rw: Muraho

# homeCreateAdvert
source: Create an advert
rw: Tanga itangazo

# homeCreateDetail
source: Report if you find or lost an item
rw: Tanga raporo niba wataye cyangwa wabonye ikintu

# homeLostFOund
source: Losst $ found items
rw: Ibintu byatakaye n'ibiboneka

# homeLostFoundDetail
source: Go through the lost and
rw: Reba mu byatakaye

# homeLostFoundDetailfound
source: found items
rw: n'ibiboneka

# homeSearch
source: Search on Map
rw: Shakisha kuri karita

# homeSearchdetail
source: Search for lost found Items on locations near you
rw: Shakisha ibintu byatakaye cyangwa biboneka mu duce dukwegereye

# homeSearchDetailNear
source: near you
rw: bikwegereye

source: Loading name...
rw: Turimo gupakira izina...

source: Loading phone...
rw: Turimo gupakira nimero ya telefoni...

source: Error
rw: Ikosa

source: Favorites
rw: Ibikunzwe

source: About us
rw: Ibyerekeye Twebwe

source: Messages
rw: Ubutumwa

source: LogOut
rw: Sohoka

# logoutFailed
source: Logout failed on server.
rw: Gusohoka byanze ku rubuga.

# logoutError
source: Logout error: {error}
rw: Ikosa ryo gusohoka:

source: My items
rw: Ibintu byanjye

source: chat
rw: Ikiganiro

source: map
rw: Ikarita

# additionalInfo
source: Additional information
rw: Amakuru yandi

source: Brand
rw: Ikirango

source: posted
rw: Byashyizweho

# adPostedby
source: Posted BY
rw: Byashyizweho na

source: Send Message
rw: Ohereza ubutumwa

source: search
rw: Shakisha

source: More Info
rw: Andi makuru

# typeMessage
source: Type your message
rw: Andika ubutumwa bwawe

source: Choose Language
rw: Hitamo ururimi

# whatLanguage
source: What language do you want to use ?
rw: Ni uruhe rurimi ushaka gukoresha?

# next
source: Continue
rw: Komeza

source: Report Lost Item
rw: Tangaza ikintu cyabuze

source: Locate Found Item
rw: Shakisha ikintu cyabonetse

source: Instant Messaging
rw: Ubutumwa bwihuse

source: skip
rw: Subira
